"""Open-source quiz."""

# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Ответ: Да.
#
# Напишите название понравившейся компании и ссылку на репозиторий
#
# Ответ: Google Deep-Mind.
#
# Проект активно принимает стороннюю помощь?
#
# Ответ: Да
#
# Напишите второе улучшение которое вы сделали
#
# Ответ: Изменение в README.
#
# Посмотрите на коммиты в основной ветке, напишите общее количество
#
# Ответ: 327.
#
# Когда был последний коммит?
#
# Ответ: 3 дня назад.
#
# Сколько контрибьюторов у проекта?
#
# Ответ: 33 контрибьютора.
#
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# Ответ: В среднем 3-5 коммитов в неделю.
#
# Сколько сейчас открытых ишью?
#
# Ответ: 122.
#
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#
# Ответ: Да, отвечают в течении пару часов насчет ишью.
#
# Ведётся ли активное обсуждение ишью?
#
# Ответ: В зависимости от ишью. Чаще просто один полный ответ от команды проекта.
#
# Есть ли недавно созданные ишью?
#
# Ответ: Да, 5 часов назад.
#
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
# Ответ: Да, 69 закрытых.
#
# Сколько сейчас открытых пул-реквестов?
#
# Ответ: 165 открытых и 338 закрытых.
#
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Ответ: Да, как и на ишью дают полноцценных ответ.
#
# Ведётся ли активное обсуждение пул-реквестов?
#
# Ответ: В зависимости от проблемы. Чаще нет.
#
# Есть ли недавно отправленные пул-реквесты?
#
# Ответ: Да, 5 часов назад вместе с ишью.
#
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# Ответ: Последни закрытый и есть мердж неделю назад.
#
