"""Open Source questions."""

# GitHub
# 1.1. Что такое GitHub?
#
# Ответ: Платформа для хранения, взаимодействия и контрибьютинга в проектах. Весь код на GitHub Open-Source.
#
# 1.2. Как GitHub связан с Git?
#
# Ответ: Git - система контроля версий. GitHub - сайт для хранения этих версий удаленно и взаимодействия с ними через Git.
#
# 1.3. Чем отличается fork репозитория от его клонирования (clone)?
#
# Ответ: Форк это копирование репозитория к себе в аккаунт GitHub, а клонирование это копирование репозитория на комп локально.
#
# 1.4. Зачем нужны и как работают pull requests?
#
# Ответ: Они нужны для того, чтобы другие люди могли сделать запрос на слияние их репозитория с оригинальным. Они работают по принципу форк -> изменения -> коммит -> пул-реквест в оригинал.
#
# 1.5. GitHub использует ваш почтовый адрес для привязки ваших Git коммитов к вашей учётной записи?
#
# Ответ: Да, использует.
#
# 1.6 Какая команда генерирует SSH ключ для Доступа по SSH к репозиторию (Рисунок 83)
#
# Ответ: ssh-keygen -t ed25519 -C "your_email@example.com"
#
